# 6001 [기초-출력] 출력하기01(설명)

# python 언어에서 가장 기본적인 명령이 출력문이다.
# print( )를 이용해 다음 단어를 출력하시오.

# Hello

print('Hello')


# -------------------------------
# 6002 [기초-출력] 출력하기02(설명)

# 이번에는 공백( )을 포함한 문장을 출력한다.
# 다음 문장을 출력해보자.

# Hello World
# (대소문자에 주의한다.)

print('Hello World')


# -------------------------------
# 6003 [기초-출력] 출력하기03(설명)

# 이번에는 줄을 바꿔 출력하는 출력문을 연습해보자.
# 다음과 같이 줄을 바꿔 출력해야 한다.

# Hello
# World
# (두 줄에 걸쳐 줄을 바꿔 출력)

print('Hello')
print('World')


# -------------------------------
# 6004 [기초-출력] 출력하기04(설명)

# 이번에는 작은 따옴표(')(single quotation mark)가 들어있는 출력문 연습을 해보자.
# 다음 문장을 출력하시오.

# 'Hello'

print("'Hello'")


# -------------------------------
# 6005 [기초-출력] 출력하기05(설명)

# 이번에는 큰따옴표(")(double quotation mark)가 포함된 출력문을 연습해보자.
# 다음 문장을 출력하시오.

# "Hello World"
# (단, 큰따옴표도 함께 출력한다.)

print('"Hello World"')


# -------------------------------
# 6006 [기초-출력] 출력하기06

# 이번에는 특수문자 출력에 도전하자!!
# 다음 문장을 출력하시오.

# "!@#$%^&*()'
# (단, 큰따옴표와 작은따옴표도 함께 출력한다.)

print('"!@#$%^&*()\'')


# -------------------------------
# 6007 [기초-출력] 출력하기07

# 윈도우 운영체제의 파일 경로를 출력하는 연습을 해보자. 
# 파일 경로에는 특수문자들이 포함된다.
# 다음 경로를 출력하시오.

# "C:\Download\'hello'.py"
# (단, 따옴표도 함께 출력한다.)

print('"C:\Download\\\'hello\'.py"')


# -------------------------------
# 6008 [기초-출력] 출력하기08

# 이번에는 다음과 같은 python프로그램의 소스코드를 출력해보자.

# print("Hello\nWorld")
# 위 코드를 정확히 그대로 출력하시오.(공백문자 주의)

print('print(\"Hello\\nWorld\")')